; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph0 - mode
	infrared1 - mode
	image2 - mode
	Star0 - direction
	Star1 - direction
	GroundStation3 - direction
	Star2 - direction
	Planet4 - direction
	Planet5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet4)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 196)
	(= (data Planet4 spectrograph0) 155)
	(= (data Planet5 spectrograph0) 103)
	(= (data Planet6 spectrograph0) 297)
	(= (data Phenomenon7 spectrograph0) 212)
	(= (data Planet8 spectrograph0) 74)
	(= (data Planet4 infrared1) 67)
	(= (data Planet5 infrared1) 232)
	(= (data Planet6 infrared1) 212)
	(= (data Phenomenon7 infrared1) 201)
	(= (data Planet8 infrared1) 172)
	(= (data Planet4 image2) 31)
	(= (data Planet5 image2) 70)
	(= (data Planet6 image2) 71)
	(= (data Phenomenon7 image2) 294)
	(= (data Planet8 image2) 284)
	(= (slew_time Star1 Star0) 2.919)
	(= (slew_time Star0 Star1) 2.919)
	(= (slew_time GroundStation3 Star0) 29.28)
	(= (slew_time Star0 GroundStation3) 29.28)
	(= (slew_time GroundStation3 Star1) 10.75)
	(= (slew_time Star1 GroundStation3) 10.75)
	(= (slew_time GroundStation3 Star2) 80.91)
	(= (slew_time Star2 GroundStation3) 80.91)
	(= (slew_time Star2 Star0) 70.86)
	(= (slew_time Star0 Star2) 70.86)
	(= (slew_time Star2 Star1) 11.1)
	(= (slew_time Star1 Star2) 11.1)
	(= (slew_time Planet4 Star0) 48.7)
	(= (slew_time Star0 Planet4) 48.7)
	(= (slew_time Planet4 Star1) 84.76)
	(= (slew_time Star1 Planet4) 84.76)
	(= (slew_time Planet4 Star2) 45.55)
	(= (slew_time Star2 Planet4) 45.55)
	(= (slew_time Planet4 GroundStation3) 56.08)
	(= (slew_time GroundStation3 Planet4) 56.08)
	(= (slew_time Planet5 Star0) 60.74)
	(= (slew_time Star0 Planet5) 60.74)
	(= (slew_time Planet5 Star1) 21.54)
	(= (slew_time Star1 Planet5) 21.54)
	(= (slew_time Planet5 Star2) 19.8)
	(= (slew_time Star2 Planet5) 19.8)
	(= (slew_time Planet5 GroundStation3) 7.115)
	(= (slew_time GroundStation3 Planet5) 7.115)
	(= (slew_time Planet5 Planet4) 69.1)
	(= (slew_time Planet4 Planet5) 69.1)
	(= (slew_time Planet6 Star0) 42.98)
	(= (slew_time Star0 Planet6) 42.98)
	(= (slew_time Planet6 Star1) 22.67)
	(= (slew_time Star1 Planet6) 22.67)
	(= (slew_time Planet6 Star2) 9.519)
	(= (slew_time Star2 Planet6) 9.519)
	(= (slew_time Planet6 GroundStation3) 58.31)
	(= (slew_time GroundStation3 Planet6) 58.31)
	(= (slew_time Planet6 Planet4) 39.17)
	(= (slew_time Planet4 Planet6) 39.17)
	(= (slew_time Planet6 Planet5) 7.143)
	(= (slew_time Planet5 Planet6) 7.143)
	(= (slew_time Phenomenon7 Star0) 18.29)
	(= (slew_time Star0 Phenomenon7) 18.29)
	(= (slew_time Phenomenon7 Star1) 50.15)
	(= (slew_time Star1 Phenomenon7) 50.15)
	(= (slew_time Phenomenon7 Star2) 9.609)
	(= (slew_time Star2 Phenomenon7) 9.609)
	(= (slew_time Phenomenon7 GroundStation3) 45.73)
	(= (slew_time GroundStation3 Phenomenon7) 45.73)
	(= (slew_time Phenomenon7 Planet4) 85.77)
	(= (slew_time Planet4 Phenomenon7) 85.77)
	(= (slew_time Phenomenon7 Planet5) 59.94)
	(= (slew_time Planet5 Phenomenon7) 59.94)
	(= (slew_time Phenomenon7 Planet6) 40.4)
	(= (slew_time Planet6 Phenomenon7) 40.4)
	(= (slew_time Planet8 Star0) 1.439)
	(= (slew_time Star0 Planet8) 1.439)
	(= (slew_time Planet8 Star1) 59.5)
	(= (slew_time Star1 Planet8) 59.5)
	(= (slew_time Planet8 Star2) 31.16)
	(= (slew_time Star2 Planet8) 31.16)
	(= (slew_time Planet8 GroundStation3) 21.81)
	(= (slew_time GroundStation3 Planet8) 21.81)
	(= (slew_time Planet8 Planet4) 42.75)
	(= (slew_time Planet4 Planet8) 42.75)
	(= (slew_time Planet8 Planet5) 15.75)
	(= (slew_time Planet5 Planet8) 15.75)
	(= (slew_time Planet8 Planet6) 31.54)
	(= (slew_time Planet6 Planet8) 31.54)
	(= (slew_time Planet8 Phenomenon7) 1.64)
	(= (slew_time Phenomenon7 Planet8) 1.64)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Planet5 infrared1)
	(have_image Planet6 spectrograph0)
	(have_image Phenomenon7 spectrograph0)
	(have_image Planet8 spectrograph0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 star2 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 196 to 150.45, (fuel-used) from 0 to 45.55
   goals met: 0 of 4
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
3. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 4
4. (turn_to satellite0 planet5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 150.45 to 130.65, (fuel-used) from 45.55 to 65.35
   goals met: 0 of 4
5. (take_image satellite0 planet5 instrument0 infrared1)
   added: (have_image planet5 infrared1)
   changed: (data_capacity satellite0) from 1000 to 768, (data-stored) from 0 to 232
   goals met: 1 of 4
6. (turn_to satellite0 phenomenon7 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 130.65 to 70.71, (fuel-used) from 65.35 to 125.29
   goals met: 1 of 4
7. (take_image satellite0 phenomenon7 instrument0 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   changed: (data_capacity satellite0) from 768 to 556, (data-stored) from 232 to 444
   goals met: 2 of 4
8. (turn_to satellite0 planet8 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet8)
   changed: (fuel satellite0) from 70.71 to 69.07, (fuel-used) from 125.29 to 126.93
   goals met: 2 of 4
9. (take_image satellite0 planet8 instrument0 spectrograph0)
   added: (have_image planet8 spectrograph0)
   changed: (data_capacity satellite0) from 556 to 482, (data-stored) from 444 to 518
   goals met: 3 of 4
10. (turn_to satellite0 planet6 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 69.07 to 37.53, (fuel-used) from 126.93 to 158.47
   goals met: 3 of 4
11. (take_image satellite0 planet6 instrument0 spectrograph0)
   added: (have_image planet6 spectrograph0)
   changed: (data_capacity satellite0) from 482 to 185, (data-stored) from 518 to 815
   goals met: 4 of 4
